{
  "date_range": {
    "start_date": "2025-07-07",
    "end_date": "2025-07-20"
  },
  "cte_events": [
    {
      "category_name": "GMA Professional Development Series",
      "description": "Elevate your career with the GMA Professional Development Series at Texas A&M University! This enriching set of virtual workshops focuses on enhancing professional skills, fostering effective communication, and promoting independence. Don't miss this chance to learn, grow, and excel in your field. Make a positive impact on your career - sign up today!",
      "events": [
        {
          "event_name": "GMA | Promoting Professional Development ",
          "event_link": "https://calendar.tamu.edu/cte/event/354506-gma-promoting-professional-development-monday-july-7-",
          "event_date": "Monday, July 7, 2025",
          "event_time": "10:00am - 11:30am CDT",
          "event_location": "Zoom",
          "event_registration_link": "https://gradconnect.tamu.edu/register/?id=3e018a6b-a62e-48f7-a911-ad726bc00255"
        },
        {
          "event_name": "GMA | Maintaining Effective Communication ",
          "event_link": "https://calendar.tamu.edu/cte/event/354507-gma-maintaining-effective-communication-wednesday-jul",
          "event_date": "Wednesday, July 9, 2025",
          "event_time": "2:00pm - 4:00pm CDT",
          "event_location": "Zoom",
          "event_registration_link": "https://gradconnect.tamu.edu/register/?id=a5b2cf48-a664-49bc-aa3a-674a9fe1537e"
        },
        {
          "event_name": "GMA | Fostering Independence ",
          "event_link": "https://calendar.tamu.edu/cte/event/354508-gma-fostering-independence-tuesday-july-15-1200-130-p",
          "event_date": "Tuesday, July 15, 2025",
          "event_time": "12:00pm - 1:30pm CDT",
          "event_location": "Zoom",
          "event_registration_link": "https://gradconnect.tamu.edu/register/?id=fc4f01af-85cc-4971-9bcd-afda2313e66c"
        },
        {
          "event_name": "GMA | Aligning Expectations ",
          "event_link": "https://calendar.tamu.edu/cte/event/354509-gma-aligning-expectations-thursday-july-17-900-1030-a",
          "event_date": "Thursday, July 17, 2025",
          "event_time": "9:00am - 10:30am CDT",
          "event_location": "Zoom",
          "event_registration_link": "https://gradconnect.tamu.edu/register/?id=9ae7a37b-9101-4c11-a0cc-33a25da8d140"
        }
      ]
    },
    {
      "category_name": "Digital Learning Expo",
      "description": "Dive into the future of education at Texas A&M's Digital Learning Expo! Explore and engage with cutting-edge trends in virtual and on-site teaching through our dynamic workshops. Don't miss this opportunity to enhance your digital teaching skills, network with peers, and revolutionize your classroom. Sign up today and foster a world-class learning environment!",
      "events": [
        {
          "event_name": "(In-Person) Digital Learning Expo",
          "event_link": "https://calendar.tamu.edu/cte/event/353492-in-person-digital-learning-expo",
          "event_date": "Wednesday, July 16, 2025",
          "event_time": "8:30am - 3:30pm CDT",
          "event_location": "Blocker Building",
          "event_facilitators": "Dr. Jamie Thompson, Center for Teaching Excellence\nReem Hussein, Center for Teaching Excellence\nCarlos Perez, Center for Teaching Excellence\nDr. Armanto Sutedjo, Center for Teaching Excellence\nJobin Varughese, Center for Teaching Excellence\nDr. Sueli Rocha-Rojas, Center for Teaching Excellence",
          "event_registration_link": "https://ers.tamu.edu/register.aspx?scheduleid=44798",
          "event_description": "Join our interactive Digital Learning Expo, featuring workshops on the latest trends and innovations in digital learning, including Digital Accessibility, Generative AI, and analytics. Gain practical strategies for enhancing your courses, and collaborate with peers to integrate these strategies effectively."
        },
        {
          "event_name": "(Virtual) Digital Learning Expo",
          "event_link": "https://calendar.tamu.edu/cte/event/353494-virtual-digital-learning-expo",
          "event_date": "Wednesday, July 16, 2025",
          "event_time": "8:30am - 3:30pm CDT",
          "event_location": "Zoom",
          "event_facilitators": "Dr. Jamie Thompson, Center for Teaching Excellence\nReem Hussein, Center for Teaching Excellence\nCarlos Perez, Center for Teaching Excellence\nDr. Armanto Sutedjo, Center for Teaching Excellence\nJobin Varughese, Center for Teaching Excellence\nDr. Sueli Rocha-Rojas, Center for Teaching Excellence",
          "event_registration_link": "https://ers.tamu.edu/register.aspx?scheduleid=44797",
          "event_description": "Join our engaging workshops at the Digital Learning Expo, focusing on the latest trends in digital learning including Accessibility, Generative AI, Third Party tools, and New analytics. Gain practical strategies for your courses and valuable resources that address a variety of educational contexts, impact of current digital trends, and collaborative strategies integration."
        }
      ]
    },
    {
      "category_name": "Additional Events",
      "description": "Dive into the world of 'Additional Events' at Texas A&M University, designed to foster innovation in teaching and community engagement. Learn high-impact teaching methods for student success and explore the possibilities of community-engaged learning. Don't miss this opportunity to transform your pedagogical approach and create a more dynamic, effective learning environment. Sign up now and take the first step towards a more engaging and impactful educational journey!",
      "events": [
        {
          "event_name": "Empower And Engage: High-Impact Teaching For Student Success",
          "event_link": "https://calendar.tamu.edu/cte/event/353490-empower-and-engage-high-impact-teaching-for",
          "event_date": "Tuesday, July 15, 2025",
          "event_time": "10:30am - 11:30am CDT",
          "event_location": "Zoom",
          "event_facilitators": "Dr. Nate Poling, Center for Teaching Excellence",
          "event_registration_link": "https://ers.tamu.edu/register.aspx?scheduleid=44795",
          "event_description": "Join our interactive session that focuses on transforming teaching methods to support student success. By exploring high-impact practices like community-engaged learning, collaborative projects, and writing-intensive courses, educators will acquire actionable strategies to stimulate student engagement, enhance course design, and foster meaningful learning experiences. This workshop offers practical tools to invigorate courses and unlock student potential."
        },
        {
          "event_name": "Connecting Classrooms And Communities: An Introduction To Community-Engaged Learning",
          "event_link": "https://calendar.tamu.edu/cte/event/353493-connecting-classrooms-and-communities-an",
          "event_date": "Thursday, July 17, 2025",
          "event_time": "9:00am - 10:00am CDT",
          "event_location": "Zoom",
          "event_registration_link": "https://ers.tamu.edu/register.aspx?scheduleid=44799",
          "event_facilitators": "Dr. Nate Poling, Center for Teaching Excellence\n",
          "event_description": "Join us to learn about community-engaged learning practices and how they can enhance undergraduate education. This session will provide an overview of these practices and practical strategies for their integration into course design, aiming to boost student engagement and success. Whether new to this concept or looking to innovate teaching methods, participants will find valuable insights and tools for lasting impact on students' learning journey."
        }
      ]
    },
    {
      "category_name": "Digital Accessibility Series",
      "description": "\"Dive into the Digital Accessibility Series at Texas A&M University, an engaging exploration of online inclusivity standards and practices. Gain valuable insights on improving digital content accessibility, from PDF files to web design. Boost your skill set, enhance user experience, and meet mandated accessibility standards. Sign up now and be part of creating a more accessible digital world!\"",
      "events": [
        {
          "event_name": "Digital Accessibility Series – Session 3: Improving Accessibility Of PDF Files",
          "event_link": "https://calendar.tamu.edu/cte/event/353466-digital-accessibility-series-session-3-improving",
          "event_date": "Wednesday, July 9, 2025",
          "event_time": "1:00pm - 1:45pm CDT",
          "event_location": "Zoom",
          "event_facilitators": "Carlos Perez, Center for Teaching Excellence\nDr. Jamie Thompson, Center for Teaching Excellence",
          "event_registration_link": "https://ers.tamu.edu/register.aspx?scheduleid=44794",
          "event_description": "Join our returning series on the recent Title II revision, focusing on the accessibility standards of digital content, specifically PDF files. This session will address common challenges in PDF remediation, exploring typical accessibility issues and providing practical experience with Adobe Acrobat's built-in accessibility checker."
        }
      ]
    },
    {
      "category_name": "Course Design Series",
      "description": "Dive into the Course Design Series at Texas A&M University, a dynamic academic series focused on the art and science of crafting effective course frameworks. Gain valuable insights on creating strategic learning outcomes, and discover essential tools for course context planning. Enhance your teaching prowess, engage students more effectively, and elevate your career. Don't miss out, sign up today!",
      "events": [
        {
          "event_name": "Course Design Series: Session 1 - Crafting Learning Outcomes, The Foundation Of A Course",
          "event_link": "https://calendar.tamu.edu/cte/event/353491-course-design-series-session-1-crafting-learning",
          "event_date": "Tuesday, July 15, 2025",
          "event_time": "2:00pm - 3:00pm CDT",
          "event_location": "Zoom",
          "event_facilitators": "Jean Layne, Center for Teaching Excellence\nCarlos Perez, Center for Teaching Excellence\nDr. Armanto Sutedjo, Center for Teaching Excellence",
          "event_registration_link": "https://ers.tamu.edu/register.aspx?scheduleid=44796",
          "event_description": "Explore the fundamentals of course design and learning outcomes. Learn and practice the creation and revision of effective, student-centered learning outcomes, keeping in mind the course context. Engage with tools that facilitate outcome creation and sharing with students via platforms like Canvas. Begin your journey in mapping course alignment."
        }
      ]
    }
  ],
  "elp_events": [
    {
      "category_name": "Virtual Language Lab Workshops",
      "description": "Unleash your linguistic potential with Texas A&M's Virtual Language Lab Workshops! Harness advanced tools for enhancing English proficiency at your convenience, right from home. These interactive online sessions promise to refine your pronunciation and listening skills. Don't miss out, faculty and staff - sign up and elevate your communication capabilities to new heights!",
      "events": [
        {
          "event_name": "Live Workshop In The Virtual Language Lab For English Proficiency",
          "event_link": "https://calendar.tamu.edu/elp/event/354470-live-workshop-in-the-virtual-language-lab-for-english",
          "event_date": "Tuesday, July 8, 2025",
          "event_time": "12:00pm - 1:00pm CDT",
          "event_location": "Zoom",
          "event_facilitators": "Ginessa Payne, Center for Teaching Excellence",
          "event_registration_link": "https://ers.tamu.edu/event/9373",
          "event_description": "Enhance your pronunciation and listening skills through the CTE-ELP Virtual Language Lab, a free online platform. This interactive workshop, designed for ESL speakers, allows participants to experience various exercises in the Lab, aiding in familiarization and query resolution. Attendees will learn how to use voice typing for feedback, respond to a range of quiz questions, and gain independence in using the Lab."
        }
      ]
    }
  ],
  "weekly_events": [
    {
      "category_name": "Microteaching Practice (English Language Proficiency)",
      "description": "Dive into our Microteaching Practice series at Texas A&M University, designed to cultivate your teaching prowess and public speaking finesse. Each week, you'll deliver a micro-lecture in a supportive environment, honing your skills while receiving invaluable feedback. Witness your confidence grow as an educator and communicator, with the guidance of our experienced consultants and engaged undergraduate students. Don't miss this opportunity to elevate your professional abilities. Join us and discover the transformative power of focused, sustained practice!",
      "event_link": "https://calendar.tamu.edu/elp/event/354392-microteaching-practice-english-language",
      "event_registration_link": "https://ers.tamu.edu/event/8325",
      "weekly_event_info": "The Microteaching Practice series, focusing on English Language Proficiency, is held virtually every Monday and Wednesday from 8:30am - 9:30am and 10:00am - 11:00am CDT, respectively. Facilitators include Ginessa Payne and Michele Vick from the Center for Teaching Excellence."
    },
    {
      "category_name": "ELP Journal Club: A Conversation Circle For Text-Based Discussions",
      "description": "Dive into enriching text-based discussions at our ELP Journal Club, an academic event series tailored for international faculty and TAs at Texas A&M University. Each week, you'll gain confidence as you prepare, read, and lead discussions on selected articles. This engaging platform not only refines your presentation skills but also fosters a deeper understanding of diverse academic texts. Don't miss the chance to enhance your academic discourse skills and broaden your intellectual horizons. Sign up today for a transformative experience!",
      "event_link": "https://calendar.tamu.edu/elp/event/354403-elp-journal-club-a-conversation-circle-for",
      "event_registration_link": "https://ers.tamu.edu/event/10889",
      "weekly_event_info": "The ELP Journal Club is virtually held every Monday from 11:00am to 12:00pm CDT, facilitated by Michele Vick from the Center for Teaching Excellence."
    },
    {
      "category_name": "Conversation Circle For English Language Proficiency",
      "description": "\"Join our Conversation Circle series, an engaging platform designed to enhance your English language proficiency through lively and cultural discussions. This weekly event provides a supportive environment to cultivate spontaneous speaking, active listening, and conversational turn-taking skills. Grasp the nuances of American university culture, and evolve your communication prowess interacting with varied speakers. Faculty and staff, amplify your English articulation and comprehension in this enriching journey. Don't miss this unique opportunity to broaden your horizons!\"",
      "event_link": "https://calendar.tamu.edu/elp/event/354418-conversation-circle-for-english-language",
      "event_registration_link": "https://ers.tamu.edu/event/7534",
      "weekly_event_info": "The \"Conversation Circle For English Language Proficiency\" sessions are held virtually on Tuesdays and Thursdays from 8:00am - 9:00am CDT, and in person at BLOCKER 236 A on Wednesdays from 1:00pm - 2:00pm CDT. They are facilitated by Michele Vick and Sarah Vargas from the Center for Teaching Excellence."
    }
  ]
}