{
  "Microteaching Practice (English Language Proficiency)": {
    "description": "Join us for our weekly Microteaching Practice series, a transformative opportunity to refine your teaching prowess and public speaking skills. Each session allows you to deliver a short presentation, and receive insightful feedback from our skilled consultants and students. This experience promises to enhance your communication skills, boost your confidence, and improve student engagement in your classroom. Whether you're a seasoned educator or a staff member seeking improvement, this series offers invaluable learning opportunities. Sign up today and take the first step towards empowering your teaching journey at Texas A&M University.",
    "weekly_event_info": "The Microteaching Practice series for English Language Proficiency happens virtually on Mondays and Wednesdays, from 8:30am - 9:30am and 10:00am - 11:00am CDT, respectively. Facilitated by Ginessa Payne and Michele Vick from the Center for Teaching Excellence."
  },
  "ELP Journal Club: A Conversation Circle For Text-Based Discussions": {
    "description": "Join us for the ELP Journal Club, a transformative weekly series at Texas A&M University. Tailored specifically for international TAs and faculty, this event provides participants the opportunity to enhance their reading and discussion skills through the analysis of pre-selected texts. With each session, you'll gain confidence, expand your perspectives, and foster meaningful academic conversations. Don't miss this chance to become a more effective, engaging educator. Sign up today and unlock a new level of academic excellence!",
    "weekly_event_info": "The ELP Journal Club meets virtually every Monday from 11:00am - 12:00pm CDT, facilitated by Michele Vick from the Center for Teaching Excellence."
  },
  "Conversation Circle For English Language Proficiency": {
    "description": "Join us weekly for the Conversation Circle, an enriching platform designed to enhance English language proficiency through immersive dialogue. Dive into stimulating discussions centered around diverse cultural topics, including the unique facets of American academia. This interactive series promises the development of your spontaneous speaking, active listening, and conversational transitions. By engaging with a variety of speakers, you'll cultivate a deeper understanding and confidence in English communication. Don’t miss this opportunity to elevate your linguistic skills and connect with the Texas A&M community.",
    "weekly_event_info": "The \"Conversation Circle For English Language Proficiency\" series takes place virtually on Tuesdays and Thursdays from 8:00am - 9:00am and 9:00am - 10:00am CDT respectively, and physically in BLOCKER 236 A on Wednesdays from 1:00pm - 2:00pm CDT. Facilitators are Michele Vick and Sarah Vargas from the Center for Teaching Excellence."
  }
}