{
  "Microteaching Practice (English Language Proficiency)": {
    "description": "Dive into our Microteaching Practice series at Texas A&M University, designed to cultivate your teaching prowess and public speaking finesse. Each week, you'll deliver a micro-lecture in a supportive environment, honing your skills while receiving invaluable feedback. Witness your confidence grow as an educator and communicator, with the guidance of our experienced consultants and engaged undergraduate students. Don't miss this opportunity to elevate your professional abilities. Join us and discover the transformative power of focused, sustained practice!",
    "weekly_event_info": "The Microteaching Practice series, focusing on English Language Proficiency, is held virtually every Monday and Wednesday from 8:30am - 9:30am and 10:00am - 11:00am CDT, respectively. Facilitators include Ginessa Payne and Michele Vick from the Center for Teaching Excellence."
  },
  "ELP Journal Club: A Conversation Circle For Text-Based Discussions": {
    "description": "Dive into enriching text-based discussions at our ELP Journal Club, an academic event series tailored for international faculty and TAs at Texas A&M University. Each week, you'll gain confidence as you prepare, read, and lead discussions on selected articles. This engaging platform not only refines your presentation skills but also fosters a deeper understanding of diverse academic texts. Don't miss the chance to enhance your academic discourse skills and broaden your intellectual horizons. Sign up today for a transformative experience!",
    "weekly_event_info": "The ELP Journal Club is virtually held every Monday from 11:00am to 12:00pm CDT, facilitated by Michele Vick from the Center for Teaching Excellence."
  },
  "Conversation Circle For English Language Proficiency": {
    "description": "Join our Conversation Circle series, an engaging platform designed to enhance your English language proficiency through lively and cultural discussions. This weekly event provides a supportive environment to cultivate spontaneous speaking, active listening, and conversational turn-taking skills. Grasp the nuances of American university culture, and evolve your communication prowess interacting with varied speakers. Faculty and staff, amplify your English articulation and comprehension in this enriching journey. Don't miss this unique opportunity to broaden your horizons!",
    "weekly_event_info": "The \"Conversation Circle For English Language Proficiency\" sessions are held virtually on Tuesdays and Thursdays from 8:00am - 9:00am CDT, and in person at BLOCKER 236 A on Wednesdays from 1:00pm - 2:00pm CDT. They are facilitated by Michele Vick and Sarah Vargas from the Center for Teaching Excellence."
  }
}