{
  "Conversation Circle For English Language Proficiency": {
    "description": "Immerse yourself in the enriching world of the Conversation Circle at Texas A&M University, a weekly event series designed to enhance English language proficiency. Dive into enlightening group discussions on diverse cultural topics, honing your spontaneous speaking and active listening skills. Experience the benefits of conversational turn-taking and discover the nuances of American university culture. Don't miss this wonderful opportunity to communicate with speakers from various backgrounds. Join us and transform your linguistic abilities to new heights!",
    "weekly_event_info": "The \"Conversation Circle For English Language Proficiency\" series occurs virtually on Tuesdays and Thursdays at 8:00am - 9:00am and 9:00am - 10:00am CDT respectively, and in-person on Wednesdays at 1:00pm - 2:00pm CDT in BLOCKER 236 A. Facilitators are Michele Vick and Sarah Vargas from the Center for Teaching Excellence."
  },
  "Microteaching Practice (English Language Proficiency)": {
    "description": "Join us at Texas A&M's weekly Microteaching Practice event series, a workshop designed to bolster your teaching and public speaking abilities. Hone your skills through engaging 5-minute demonstration lessons in a supportive, low-stakes setting. Get valuable insights and constructive feedback from experienced consultants and eager undergraduate students. Don't miss this opportunity to refine your pedagogy and boost your confidence. Sign up now and elevate your teaching journey!",
    "weekly_event_info": "The Microteaching Practice series for English Language Proficiency takes place virtually on Mondays, 8:30-9:30am CDT, and Wednesdays, 10:00-11:00am CDT. Sessions are facilitated by Ginessa Payne and Michele Vick from the Center for Teaching Excellence."
  },
  "ELP Journal Club: A Conversation Circle For Text-Based Discussions": {
    "description": "Join the ELP Journal Club, a dynamic conversation circle where international TAs and faculty gather to enhance their skills in text-based discussions. Engage in stimulating dialogues, hone your leadership abilities, and boost your confidence in reading aloud. With a short article shared in advance each week, you're empowered to lead and participate actively. Unleash your potential and enrich your academic journey at Texas A&M University. Don't miss out - sign up today and contribute to this vibrant academic exchange!",
    "weekly_event_info": "The ELP Journal Club, a platform for text-based discussions, is facilitated by Michele Vick from the Center for Teaching Excellence. Join us virtually every Monday from 11:00am - 12:00pm CDT."
  }
}